[
  {
    "slug": "created-by-modified-by-columns-behavior-in-a-canvas-app-cloud-flow-dataverse-scenario",
    "title": "\"Created by\" / \"Modified by\" columns behavior in a canvas app + cloud flow + Dataverse scenario",
    "date": "2021-08-16",
    "tags": [
      "power-platform",
      "dataverse",
      "canvas-app",
      "power-automate",
      "cloud-flow"
    ],
    "description": "An investigation into why 'Created by' and 'Modified by' columns in Dataverse don't reflect the actual end user when records are created via cloud flows triggered from canvas apps — and which connector configurations correctly resolve the issue."
  },
  {
    "slug": "tracking-changes-in-open-source-projects",
    "title": "Tracking changes in open source projects",
    "date": "2021-08-04",
    "tags": [
      "open-source",
      "devops",
      "github",
      "git",
      "changelog"
    ],
    "description": "A practical guide to adopting the keep-a-changelog convention in open source projects, including how to create and back-date git tags to build a meaningful, auditable version history."
  },
  {
    "slug": "q-and-a-about-alm-and-power-platform",
    "title": "Q&A about ALM and Power Platform",
    "date": "2021-05-03",
    "tags": [
      "power-platform",
      "alm",
      "git",
      "branching-strategy",
      "devops"
    ],
    "description": "Answers to practical questions from a fellow Microsoft MVP on branching strategies, repository content decisions, and the recommended end-to-end flow for delivering Power Platform solutions from development to production."
  },
  {
    "slug": "why-devops-culture-matters-working-with-the-power-platform",
    "title": "Why DevOps culture matters working with the Power Platform?",
    "date": "2021-01-22",
    "tags": [
      "power-platform",
      "devops",
      "devops-culture",
      "citizen-developer",
      "alm"
    ],
    "description": "An exploration of why DevOps culture — not just the tools — is the critical differentiator for Power Platform success, and why involving citizen developers in that culture is both a challenge and an opportunity."
  },
  {
    "slug": "power-platform-enthusiasts-point-of-view-on-devops-culture",
    "title": "Power Platform enthusiast's point of view on DevOps culture",
    "date": "2020-12-31",
    "tags": [
      "power-platform",
      "devops",
      "devops-culture",
      "alm",
      "citizen-developer"
    ],
    "description": "A year-end reflection on what DevOps truly means — beyond tooling and automation — and how the DevOps mindset can reshape the way Power Platform developers and citizen developers work together to deliver value."
  },
  {
    "slug": "automate-the-integration-between-dynamics-365-sales-and-teams",
    "title": "Automate the integration between Dynamics 365 Sales and Teams",
    "date": "2020-10-24",
    "tags": [
      "power-automate",
      "microsoft-teams",
      "dynamics-365",
      "microsoft-graph",
      "power-platform"
    ],
    "description": "A walkthrough of an open-source starter kit that automates the Dynamics 365 Sales and Microsoft Teams integration, covering automatic channel and tab creation across the lead-to-opportunity lifecycle, along with lessons learned and current limitations."
  },
  {
    "slug": "my-resume-built-with-the-power-platform",
    "title": "My resume built with the Power Platform",
    "date": "2020-06-12",
    "tags": [
      "power-platform",
      "power-apps",
      "power-bi",
      "power-virtual-agents",
      "canvas-apps"
    ],
    "description": "A fun personal project exploring every component of the Power Platform — Common Data Service, model-driven app, canvas apps for phone and tablet, Power BI report, and a Power Virtual Agents bot — all to build and present a resume in a novel way."
  },
  {
    "slug": "public-preview-of-the-human-resources-app-in-teams",
    "title": "Public Preview of the Human Resources app in Teams",
    "date": "2020-05-23",
    "tags": [
      "dynamics-365",
      "microsoft-teams",
      "human-resources",
      "power-platform"
    ],
    "description": "A quick look at the public preview of the Human Resources app in Microsoft Teams, highlighting available features, missing capabilities like time-off balance forecasting, and known bot errors users may encounter."
  },
  {
    "slug": "using-power-automate-in-your-teams-creation-process",
    "title": "Using Power Automate in your Teams creation process",
    "date": "2020-04-24",
    "tags": [
      "power-automate",
      "microsoft-teams",
      "microsoft-graph",
      "power-platform",
      "custom-connectors"
    ],
    "description": "Explores three Power Automate-based approaches to automating Microsoft Teams creation — cloning a template team, creating a team from scratch via an Office 365 group, and using the beta Microsoft Graph endpoint — as part of a governed self-service Teams request process."
  },
  {
    "slug": "create-a-custom-connector-for-microsoft-graph",
    "title": "Create a custom connector for Microsoft Graph",
    "date": "2020-03-24",
    "tags": [
      "power-platform",
      "microsoft-graph",
      "custom-connectors",
      "azure-ad",
      "power-automate"
    ],
    "description": "A step-by-step guide to building a Microsoft Graph custom connector in Power Apps or Power Automate, covering Azure AD app registration with OAuth 2.0, connector security configuration, and adding a first action using the Teams creation API as a live example."
  },
  {
    "slug": "integrate-help-panes-in-your-alm-process",
    "title": "Integrate Help Panes in your ALM process",
    "date": "2019-12-23",
    "tags": [
      "dynamics-365",
      "help-panes",
      "alm",
      "model-driven-apps",
      "power-platform"
    ],
    "description": "Explains how to integrate Dynamics 365 Help Pane configurations into solutions so they can travel through your ALM pipeline alongside feature development, covering both adding existing Help Pages and creating new ones directly from a solution."
  },
  {
    "slug": "configure-help-panes-in-dynamics-365",
    "title": "Configure Help Panes in Dynamics 365",
    "date": "2019-12-11",
    "tags": [
      "dynamics-365",
      "help-panes",
      "model-driven-apps",
      "power-apps",
      "customization"
    ],
    "description": "A deep dive into configuring Help Panes in Dynamics 365 model-driven apps, covering how to enable the feature, the full range of formatting and insertion options available in the editor, and how coach marks and balloons can be used to build interactive in-app guidance."
  },
  {
    "slug": "help-button-options-in-dynamics-365",
    "title": "Help button options in Dynamics 365",
    "date": "2019-12-04",
    "tags": [
      "dynamics-365",
      "customization",
      "user-experience",
      "help-panes",
      "power-platform"
    ],
    "description": "An overview of the help button options available in Dynamics 365, covering the default Microsoft documentation link, global and entity-specific custom help pages with URL parameters, and the Help Panes preview feature for building interactive in-app guidance."
  }
]